# [10 Minutes to pandas — pandas 0.20.3 documentation](https://pandas.pydata.org/pandas-docs/stable/10min.html)


10분간 따라할 수 있는 판다스 튜토리얼 이지만 실제로는 1~2시간이 걸린다.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

s = pd.Series([1,3,5,np.nan, 6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [2]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [3]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [4]:
df2 = pd.DataFrame({ 'A' : 1.,
                'B' : pd.Timestamp('20130102'),
                'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                'D' : np.array([3] * 4,dtype='int32'),
                'E' : pd.Categorical(["test","train","test","train"]),
                'F' : 'foo' })

In [5]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [6]:
df.head()

                   A         B         C         D
2013-01-01  2.250530  0.074402  1.420050  0.764797
2013-01-02  1.164902 -2.323304  2.144739  0.186234
2013-01-03  1.486935 -1.342891  1.023715  1.542497
2013-01-04  0.877800  0.312823 -0.378583 -0.436964
2013-01-05 -0.605984 -0.450273  1.192902 -1.543877

In [7]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.877800  0.312823 -0.378583 -0.436964
2013-01-05 -0.605984 -0.450273  1.192902 -1.543877
2013-01-06 -0.624169 -0.058310 -0.150917 -0.118741

In [8]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [10]:
df.values

array([[ 2.25052951,  0.07440185,  1.42005039,  0.76479717],
       [ 1.16490189, -2.32330417,  2.14473925,  0.18623422],
       [ 1.486935  , -1.34289112,  1.02371499,  1.54249671],
       [ 0.87779962,  0.31282334, -0.37858275, -0.43696406],
       [-0.60598352, -0.45027258,  1.19290242, -1.54387704],
       [-0.6241692 , -0.05830963, -0.15091664, -0.11874062]])

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.758336 -0.631259  0.875318  0.065658
std    1.158426  1.011900  0.965036  1.054668
min   -0.624169 -2.323304 -0.378583 -1.543877
25%   -0.235038 -1.119736  0.142741 -0.357408
50%    1.021351 -0.254291  1.108309  0.033747
75%    1.406427  0.041224  1.363263  0.620156
max    2.250530  0.312823  2.144739  1.542497

In [12]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.250530    1.164902    1.486935    0.877800   -0.605984   -0.624169
B    0.074402   -2.323304   -1.342891    0.312823   -0.450273   -0.058310
C    1.420050    2.144739    1.023715   -0.378583    1.192902   -0.150917
D    0.764797    0.186234    1.542497   -0.436964   -1.543877   -0.118741

In [13]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.764797  1.420050  0.074402  2.250530
2013-01-02  0.186234  2.144739 -2.323304  1.164902
2013-01-03  1.542497  1.023715 -1.342891  1.486935
2013-01-04 -0.436964 -0.378583  0.312823  0.877800
2013-01-05 -1.543877  1.192902 -0.450273 -0.605984
2013-01-06 -0.118741 -0.150917 -0.058310 -0.624169

In [14]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02  1.164902 -2.323304  2.144739  0.186234
2013-01-03  1.486935 -1.342891  1.023715  1.542497
2013-01-05 -0.605984 -0.450273  1.192902 -1.543877
2013-01-06 -0.624169 -0.058310 -0.150917 -0.118741
2013-01-01  2.250530  0.074402  1.420050  0.764797
2013-01-04  0.877800  0.312823 -0.378583 -0.436964

# Selection

* .at, .iat, .loc, iloc, .ix

## Getting

In [15]:
df[['A']]

                   A
2013-01-01  2.250530
2013-01-02  1.164902
2013-01-03  1.486935
2013-01-04  0.877800
2013-01-05 -0.605984
2013-01-06 -0.624169

In [16]:
df[0:3]

                   A         B         C         D
2013-01-01  2.250530  0.074402  1.420050  0.764797
2013-01-02  1.164902 -2.323304  2.144739  0.186234
2013-01-03  1.486935 -1.342891  1.023715  1.542497

In [17]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.164902 -2.323304  2.144739  0.186234
2013-01-03  1.486935 -1.342891  1.023715  1.542497
2013-01-04  0.877800  0.312823 -0.378583 -0.436964

## Selection by Label

In [18]:
df.loc[dates[0]]

A    2.250530
B    0.074402
C    1.420050
D    0.764797
Name: 2013-01-01 00:00:00, dtype: float64

In [19]:
df.loc[:, ['A','B']]

                   A         B
2013-01-01  2.250530  0.074402
2013-01-02  1.164902 -2.323304
2013-01-03  1.486935 -1.342891
2013-01-04  0.877800  0.312823
2013-01-05 -0.605984 -0.450273
2013-01-06 -0.624169 -0.058310

In [20]:
df.loc['20130101':'20130105', ['A','B']]

                   A         B
2013-01-01  2.250530  0.074402
2013-01-02  1.164902 -2.323304
2013-01-03  1.486935 -1.342891
2013-01-04  0.877800  0.312823
2013-01-05 -0.605984 -0.450273

In [21]:
df.loc['20130103', ['A','B']]

A    1.486935
B   -1.342891
Name: 2013-01-03 00:00:00, dtype: float64

In [22]:
df.loc[dates[0], 'A']

2.2505295099536

In [23]:
df.at[dates[0], 'A']

2.2505295099536

### Selection by Position

In [24]:
df.iloc[3]

A    0.877800
B    0.312823
C   -0.378583
D   -0.436964
Name: 2013-01-04 00:00:00, dtype: float64

In [25]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.877800  0.312823
2013-01-05 -0.605984 -0.450273

In [26]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.164902 -2.323304  2.144739  0.186234
2013-01-03  1.486935 -1.342891  1.023715  1.542497

In [27]:
df.iloc[1,1]

-2.3233041674039203

In [28]:
df.iat[1,1]  # 위 iloc와 같은 결과를 보여준다. 스칼라에? 좀 더 빠르게 접근한다.

-2.3233041674039203

### Boolean Indexing

In [29]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  2.250530  0.074402  1.420050  0.764797
2013-01-02  1.164902 -2.323304  2.144739  0.186234
2013-01-03  1.486935 -1.342891  1.023715  1.542497
2013-01-04  0.877800  0.312823 -0.378583 -0.436964

In [30]:
df[df > 0] # 음수값은 NaN으로 출력 된다.

                   A         B         C         D
2013-01-01  2.250530  0.074402  1.420050  0.764797
2013-01-02  1.164902       NaN  2.144739  0.186234
2013-01-03  1.486935       NaN  1.023715  1.542497
2013-01-04  0.877800  0.312823       NaN       NaN
2013-01-05       NaN       NaN  1.192902       NaN
2013-01-06       NaN       NaN       NaN       NaN

In [31]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  2.250530  0.074402  1.420050  0.764797    one
2013-01-02  1.164902 -2.323304  2.144739  0.186234    one
2013-01-03  1.486935 -1.342891  1.023715  1.542497    two
2013-01-04  0.877800  0.312823 -0.378583 -0.436964  three
2013-01-05 -0.605984 -0.450273  1.192902 -1.543877   four
2013-01-06 -0.624169 -0.058310 -0.150917 -0.118741  three

### setting

In [32]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
print(df.shape)
s1

(6, 4)

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [33]:
df.at[dates[0],'A'] = 0 # setting values by label

In [34]:
df.iat[0, 1] = 0 # setting values by position
df.shape

(6, 4)

In [35]:
# setting by assigning with a numpy array
df.loc[:, 'D'] = np.array([5] * len(df)) 
print(df.shape)
df

(6, 4)

                   A         B         C  D
2013-01-01  0.000000  0.000000  1.420050  5
2013-01-02  1.164902 -2.323304  2.144739  5
2013-01-03  1.486935 -1.342891  1.023715  5
2013-01-04  0.877800  0.312823 -0.378583  5
2013-01-05 -0.605984 -0.450273  1.192902  5
2013-01-06 -0.624169 -0.058310 -0.150917  5

In [36]:
# A where operation with setting
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -1.420050 -5
2013-01-02 -1.164902 -2.323304 -2.144739 -5
2013-01-03 -1.486935 -1.342891 -1.023715 -5
2013-01-04 -0.877800 -0.312823 -0.378583 -5
2013-01-05 -0.605984 -0.450273 -1.192902 -5
2013-01-06 -0.624169 -0.058310 -0.150917 -5

# Missing Data

판다스는 np.nan으로 유실 된 데이터를 표현한다. 그리고 이 데이터는 계산에는 포함되지 않는다.
재인덱싱은 특정 축에 대해 변경/추가/삭제가 가능하다.

In [37]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.420050  5  1.0
2013-01-02  1.164902 -2.323304  2.144739  5  1.0
2013-01-03  1.486935 -1.342891  1.023715  5  NaN
2013-01-04  0.877800  0.312823 -0.378583  5  NaN

In [38]:
# 유실 데이터가 있는 행을 드랍시킨다.
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.420050  5  1.0
2013-01-02  1.164902 -2.323304  2.144739  5  1.0

In [39]:
# 유실 데이터를 채워준다.
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  1.420050  5  1.0
2013-01-02  1.164902 -2.323304  2.144739  5  1.0
2013-01-03  1.486935 -1.342891  1.023715  5  5.0
2013-01-04  0.877800  0.312823 -0.378583  5  5.0

In [40]:
# null 값 여부를 출력한다.
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

# Operations
* 연산과 관련 된 정보를 더 보고 싶으면 여기를 참고 [Essential Basic Functionality — pandas 0.20.3 documentation](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop)

In [41]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  1.420050  5
2013-01-02  1.164902 -2.323304  2.144739  5
2013-01-03  1.486935 -1.342891  1.023715  5
2013-01-04  0.877800  0.312823 -0.378583  5
2013-01-05 -0.605984 -0.450273  1.192902  5
2013-01-06 -0.624169 -0.058310 -0.150917  5

In [42]:
# 연산에서는 일반적으로 유실 데이터를 제외한다.

df.mean()

A    0.383247
B   -0.643659
C    0.875318
D    5.000000
dtype: float64

In [43]:
df.mean(1)

2013-01-01    1.605013
2013-01-02    1.496584
2013-01-03    1.541940
2013-01-04    1.453010
2013-01-05    1.284162
2013-01-06    1.041651
Freq: D, dtype: float64

In [44]:
# shift(n)을 하면 n만큼 row의 값이 밀린다.
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [45]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03  0.486935 -2.342891  0.023715  4.0
2013-01-04 -2.122200 -2.687177 -3.378583  2.0
2013-01-05 -5.605984 -5.450273 -3.807098  0.0
2013-01-06       NaN       NaN       NaN  NaN

## Apply

In [46]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  1.420050   5
2013-01-02  1.164902 -2.323304  3.564790  10
2013-01-03  2.651837 -3.666195  4.588505  15
2013-01-04  3.529637 -3.353372  4.209922  20
2013-01-05  2.923653 -3.803645  5.402824  25
2013-01-06  2.299484 -3.861954  5.251908  30

In [47]:
df.apply(lambda x: x.max() - x.min())

A    2.111104
B    2.636128
C    2.523322
D    0.000000
dtype: float64

# Histogramming

In [48]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    4
1    1
2    2
3    5
4    0
5    4
6    6
7    1
8    2
9    1
dtype: int64

In [49]:
s.value_counts()

1    3
4    2
2    2
6    1
5    1
0    1
dtype: int64

## String Methods

* 문자열을 다룬다. 
* 정규표현식을 사용해서 패턴을 찾을 수도 있다.
* [Working with Text Data — pandas 0.20.3 documentation](https://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods) 이 링크로 문자열을 벡터로 다루는 법을 볼 수 있다.

In [50]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge
## concat

In [51]:
# 10개의 행과 4개의 컬럼의 랜덤 숫자를 포함하는 데이터프레임을 생성한다.
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.201843 -0.261749  0.472086 -0.095291
1  0.228300  2.076611  0.072891 -2.036549
2 -0.464653  1.978856  1.723588  0.508172
3  1.031088  0.975088  1.758114  0.497141
4 -0.095293 -1.484045  1.712906  0.522709
5  0.176667 -1.301292 -0.736273 -0.995322
6 -2.271528  0.428433 -1.557873 -0.463136
7  3.015928  0.032342  0.904530 -0.700352
8 -0.089090  1.340920 -0.424423 -0.310588
9  0.506668 -1.224815  0.958164  1.576499

In [52]:
# 3개의 행, 3번 행부터 7번행 전까지, 7번행 이후로 조각을 나눈다.
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.201843 -0.261749  0.472086 -0.095291
 1  0.228300  2.076611  0.072891 -2.036549
 2 -0.464653  1.978856  1.723588  0.508172,
           0         1         2         3
 3  1.031088  0.975088  1.758114  0.497141
 4 -0.095293 -1.484045  1.712906  0.522709
 5  0.176667 -1.301292 -0.736273 -0.995322
 6 -2.271528  0.428433 -1.557873 -0.463136,
           0         1         2         3
 7  3.015928  0.032342  0.904530 -0.700352
 8 -0.089090  1.340920 -0.424423 -0.310588
 9  0.506668 -1.224815  0.958164  1.576499]

In [53]:
# 다시 조각을 합친다.
pd.concat(pieces)

          0         1         2         3
0 -0.201843 -0.261749  0.472086 -0.095291
1  0.228300  2.076611  0.072891 -2.036549
2 -0.464653  1.978856  1.723588  0.508172
3  1.031088  0.975088  1.758114  0.497141
4 -0.095293 -1.484045  1.712906  0.522709
5  0.176667 -1.301292 -0.736273 -0.995322
6 -2.271528  0.428433 -1.557873 -0.463136
7  3.015928  0.032342  0.904530 -0.700352
8 -0.089090  1.340920 -0.424423 -0.310588
9  0.506668 -1.224815  0.958164  1.576499

## Join
* SQL스타일로 머지하기
* 데이터 베이스 스타일로 머지하는 것은 여기를 참고 [Merge, join, and concatenate — pandas 0.20.3 documentation](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [54]:
left = pd.DataFrame({'key' : ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key' : ['foo', 'foo'], 'rval': [4, 5]})

In [55]:
left

   key  lval
0  foo     1
1  foo     2

In [56]:
right

   key  rval
0  foo     4
1  foo     5

In [57]:
# 키가 모두 foo 인 4행 2열의 데이터프레임이 생성된다.
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [58]:
left = pd.DataFrame({'key' : ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key' : ['foo', 'bar'], 'rval': [4, 5]})

In [59]:
# key, lval, rval이 컬럼이 되어 2개 행인 데이터 프레임이 생성된다.
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

## Append
* 데이터프레임에 행을 추가하기

In [60]:
# 8개의 행과 4개의 컬럼을 갖는 랜덤 숫자를 생성한다. 컬럼의 이름은 A, B, C, D로 지정한다.
df = pd.DataFrame(np.random.randn(8,4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.373160  1.594052 -1.908891  1.203599
1 -0.217832 -1.865325  2.275991 -1.312816
2  0.386918  1.145987 -0.649289  1.595487
3  0.371531  2.810550 -0.176266 -0.631499
4  1.577894 -0.879169  2.981915  0.985517
5 -0.083503 -1.179978 -0.507837 -1.342442
6 -0.142638  0.266434  0.033486  0.308940
7  0.089243 -0.696176  0.893438 -0.474844

In [61]:
# index 3의 행을 가져온다.
s = df.iloc[3]
s

A    0.371531
B    2.810550
C   -0.176266
D   -0.631499
Name: 3, dtype: float64

In [62]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.373160  1.594052 -1.908891  1.203599
1 -0.217832 -1.865325  2.275991 -1.312816
2  0.386918  1.145987 -0.649289  1.595487
3  0.371531  2.810550 -0.176266 -0.631499
4  1.577894 -0.879169  2.981915  0.985517
5 -0.083503 -1.179978 -0.507837 -1.342442
6 -0.142638  0.266434  0.033486  0.308940
7  0.089243 -0.696176  0.893438 -0.474844
8  0.371531  2.810550 -0.176266 -0.631499

# Grouping
* splittitng
* Applying
* Combining

In [63]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                  'B' : ['one', 'one', 'two', 'three',
                        'two', 'two', 'one', 'three'],
                  'C' : np.random.randn(8),
                  'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.466939  0.421737
1  bar    one -0.722106 -1.161465
2  foo    two -0.425811 -0.628650
3  bar  three  1.342121 -0.202290
4  foo    two -0.244393 -0.772314
5  bar    two  1.825992 -0.274959
6  foo    one  2.899667  0.320019
7  foo  three  0.750763  0.631753

In [64]:
# A 컬럼의 값들이 groupby 되어 'foo','bar'에 대한 groupby 값이 나온다.
df.groupby('A').sum()

            C         D
A
bar  2.446007 -1.638713
foo  1.513287 -0.027455

In [65]:
# B열의 one, two, three가 groupby 된 값이 나온다.
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.722106 -1.161465
    three  1.342121 -0.202290
    two    1.825992 -0.274959
foo one    1.432728  0.741756
    three  0.750763  0.631753
    two   -0.670205 -1.400964

# Reshaping

* [MultiIndex / Advanced Indexing — pandas 0.20.3 documentation](https://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical)

* [Reshaping and Pivot Tables — pandas 0.20.3 documentation](https://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking)

# Stack

In [66]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 
                     'foo', 'foo', 'qux', 'qux'],
                   ['one', 'two', 'one', 'two', 
                    'one', 'two', 'one', 'two']]))

In [67]:
index = pd.MultiIndex.from_tuples(tuples, names = ['first', 'second'])

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns = ['A', 'B'] )

df2 = df[:4]

df2

                     A         B
first second
bar   one    -2.358169  0.220815
      two     1.324240  1.031420
baz   one     0.932866 -2.874305
      two    -0.366437 -0.468358

In [68]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -2.358169
               B    0.220815
       two     A    1.324240
               B    1.031420
baz    one     A    0.932866
               B   -2.874305
       two     A   -0.366437
               B   -0.468358
dtype: float64

In [69]:
stacked.unstack()

                     A         B
first second
bar   one    -2.358169  0.220815
      two     1.324240  1.031420
baz   one     0.932866 -2.874305
      two    -0.366437 -0.468358

In [70]:
stacked.unstack(1)

second        one       two
first
bar   A -2.358169  1.324240
      B  0.220815  1.031420
baz   A  0.932866 -0.366437
      B -2.874305 -0.468358

In [71]:
stacked.unstack(0)

first          bar       baz
second
one    A -2.358169  0.932866
       B  0.220815 -2.874305
two    A  1.324240 -0.366437
       B  1.031420 -0.468358

# Pivot Tables

In [72]:
df = pd.DataFrame({ 'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.817461 -1.245720
1     one  B  foo -0.786880  0.032529
2     two  C  foo -1.668545 -1.638190
3   three  A  bar -0.433870  0.904595
4     one  B  bar -0.680199  0.147146
5     one  C  bar -0.534477 -0.342453
6     two  A  foo  0.517927 -0.068893
7   three  B  foo -1.061015 -0.583540
8     one  C  foo -0.638899 -0.210003
9     one  A  bar -1.873141 -2.057586
10    two  B  bar -1.068053 -0.215082
11  three  C  bar  1.748988 -0.941549

In [73]:
# 엑셀 피봇테이블 기능이 pd 에도 있다.
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -1.873141  0.817461
      B -0.680199 -0.786880
      C -0.534477 -0.638899
three A -0.433870       NaN
      B       NaN -1.061015
      C  1.748988       NaN
two   A       NaN  0.517927
      B -1.068053       NaN
      C       NaN -1.668545

# Time Series

판다스는 frequency conversion 중에 리샘플링 작업을 위한 간단하고, 강력하며, 효율적인 기능을 제공한다. (예를 들어 5분간의 데이터를 초데이터로 변환하는 작업)

In [74]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
# rng
# 2012-01-01 00:00:00 ~ 2012-01-01 00:01:39 까지 100분간의 데이터를 생성

In [75]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample('5Min').sum()

2012-01-01    21117
Freq: 5T, dtype: int64

In [76]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [77]:
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    0.543343
2012-03-07    0.051290
2012-03-08   -0.728625
2012-03-09    0.137843
2012-03-10    0.857078
Freq: D, dtype: float64

In [78]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    0.543343
2012-03-07 00:00:00+00:00    0.051290
2012-03-08 00:00:00+00:00   -0.728625
2012-03-09 00:00:00+00:00    0.137843
2012-03-10 00:00:00+00:00    0.857078
Freq: D, dtype: float64

In [79]:
ts_utc.tz_convert('Asia/Seoul')

2012-03-06 09:00:00+09:00    0.543343
2012-03-07 09:00:00+09:00    0.051290
2012-03-08 09:00:00+09:00   -0.728625
2012-03-09 09:00:00+09:00    0.137843
2012-03-10 09:00:00+09:00    0.857078
Freq: D, dtype: float64

In [80]:
# freq에 M으로 월을 설정해 주고, period에 5를 설정해 주어 5달 기간을 설정한다.
rng = pd.date_range('1/1/2017', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2017-01-31   -0.392563
2017-02-28    0.369100
2017-03-31    0.028262
2017-04-30    0.638280
2017-05-31    1.424911
Freq: M, dtype: float64

In [81]:
ps = ts.to_period()
ps

2017-01   -0.392563
2017-02    0.369100
2017-03    0.028262
2017-04    0.638280
2017-05    1.424911
Freq: M, dtype: float64

In [82]:
ps.to_timestamp()

2017-01-01   -0.392563
2017-02-01    0.369100
2017-03-01    0.028262
2017-04-01    0.638280
2017-05-01    1.424911
Freq: MS, dtype: float64

In [83]:
# 분기별 기간 설정도 가능하다
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
prng

PeriodIndex(['1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
             '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
             '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
             '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
             '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
             '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
             '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
             '2000Q3', '2000Q4'],
            dtype='period[Q-NOV]', freq='Q-NOV')

In [84]:
ts = pd.Series(np.random.randn(len(prng)))
ts.shape

(44,)